// SPDX-License-Identifier: MIT
// Copyright © 2018-2021 WireGuard LLC. All Rights Reserved.
// Generic alert action names


"actionOK" = "好";
"actionCancel" = "取消";
"actionSave" = "儲存";

// Tunnels list UI

"tunnelsListTitle" = "WireGuard";
"tunnelsListSettingsButtonTitle" = "設定";
"tunnelsListCenteredAddTunnelButtonTitle" = "新增通道";
"tunnelsListSwipeDeleteButtonTitle" = "刪除";
"tunnelsListSelectButtonTitle" = "選擇";
"tunnelsListSelectAllButtonTitle" = "全選";
"tunnelsListDeleteButtonTitle" = "刪除";
"tunnelsListSelectedTitle (%d)" = "已選擇了 %d";

// Tunnels list menu

"addTunnelMenuHeader" = "新增一個 WireGuard 通道";
"addTunnelMenuImportFile" = "從檔案或是壓縮檔中建立";
"addTunnelMenuQRCode" = "從 QR code 中建立";
"addTunnelMenuFromScratch" = "從空白開始建立";

// Tunnels list alerts

"alertImportedFromMultipleFilesTitle (%d)" = "已建立 %d 個通道";

"alertImportedFromZipTitle (%d)" = "已建立 %d 個通道";

"alertBadConfigImportTitle" = "無法匯入通道";

"deleteTunnelsConfirmationAlertButtonTitle" = "刪除";
"deleteTunnelConfirmationAlertButtonMessage (%d)" = "是否刪除 %d 個通道？";
"deleteTunnelsConfirmationAlertButtonMessage (%d)" = "是否刪除 %d 個通道？";

// Tunnel detail and edit UI

"newTunnelViewTitle" = "新增設定";
"editTunnelViewTitle" = "修改設定";

"tunnelSectionTitleStatus" = "狀態";

"tunnelStatusInactive" = "未啟用";
"tunnelStatusActivating" = "啟用中";
"tunnelStatusActive" = "已啟用";
"tunnelStatusDeactivating" = "停用中";
"tunnelStatusReasserting" = "重新啟用中";
"tunnelStatusRestarting" = "重新啟動中";
"tunnelStatusWaiting" = "等待中";

"macToggleStatusButtonActivate" = "啟動";
"macToggleStatusButtonActivating" = "啟動中...";
"macToggleStatusButtonDeactivate" = "停用";
"macToggleStatusButtonDeactivating" = "停用中...";
"macToggleStatusButtonReasserting" = "重新啟用中...";
"macToggleStatusButtonRestarting" = "重新啟動中....";
"macToggleStatusButtonWaiting" = "等待中...";

"tunnelSectionTitleInterface" = "介面";

"tunnelInterfaceName" = "名稱";
"tunnelInterfacePrivateKey" = "私人金鑰";
"tunnelInterfacePublicKey" = "公開金鑰";
"tunnelInterfaceGenerateKeypair" = "產生金鑰對";
"tunnelInterfaceListenPort" = "監聽埠";
"tunnelInterfaceMTU" = "MTU";
"tunnelInterfaceDNS" = "DNS 伺服器";
"tunnelInterfaceStatus" = "狀態";
"tunnelEditPlaceholderTextAutomatic" = "自動";
"tunnelHandshakeTimestampNow" = "現在";

// Settings UI

"settingsViewTitle" = "設定";

"settingsSectionTitleAbout" = "關於";
"macMenuAbout" = "關於 WireGuard";
"macMenuQuit" = "離開 WireGuard";

"macMenuHideApp" = "隱藏 WireGuard";
"macMenuCut" = "剪下";
"macMenuCopy" = "複製";
"macMenuPaste" = "貼上";
"macMenuSelectAll" = "全選";
"macMenuToggleStatus" = "切換狀態";
"macMenuMinimize" = "最小化";
"macMenuDeleteSelected" = "Delete Selected";
"alertSystemErrorMessageTunnelConfigurationInvalid" = "The configuration is invalid.";
"tunnelPeerPublicKey" = "Public key";
"tunnelPeerEndpoint" = "Endpoint";
"alertInvalidInterfaceMessageListenPortInvalid" = "Interface’s listen port must be between 0 and 65535, or unspecified";
"addPeerButtonTitle" = "Add peer";
"tunnelHandshakeTimestampSystemClockBackward" = "(System clock wound backwards)";
"macMenuTitle" = "WireGuard";
"macAlertNoInterface" = "Configuration must have an ‘Interface’ section.";
"macNameFieldExportZip" = "Export tunnels to:";
"alertSystemErrorMessageTunnelConfigurationUnknown" = "Unknown system error.";
"macEditDiscard" = "Discard";
"tunnelPeerPresharedKeyEnabled" = "enabled";
"alertScanQRCodeCameraUnsupportedMessage" = "This device is not able to scan QR codes";
"macSheetButtonExportZip" = "Save";
"macWindowTitleManageTunnels" = "Manage WireGuard Tunnels";
"macConfirmAndQuitAlertInfo" = "If you close the tunnels manager, WireGuard will continue to be available from the menu bar icon.";
"macUnusableTunnelInfo" = "In case this tunnel was created by another user, only that user can view, edit, or activate this tunnel.";
"alertTunnelActivationErrorTunnelIsNotInactiveMessage" = "The tunnel is already active or in the process of being activated";
"alertTunnelActivationSetNetworkSettingsMessage" = "Unable to apply network settings to tunnel object.";
"macMenuExportTunnels" = "Export Tunnels to Zip…";
"macMenuShowAllApps" = "Show All";
"alertCantOpenInputConfFileTitle" = "Unable to import from file";
"alertScanQRCodeInvalidQRCodeMessage" = "The scanned QR code is not a valid WireGuard configuration";
"macDeleteTunnelConfirmationAlertInfo" = "You cannot undo this action.";
"macDeleteTunnelConfirmationAlertButtonTitleDeleting" = "Deleting…";
"tunnelPeerPersistentKeepalive" = "Persistent keepalive";
"settingsViewLogButtonTitle" = "View log";
"alertSystemErrorMessageTunnelConnectionFailed" = "The connection failed.";
"macButtonEdit" = "Edit";
"macAlertPublicKeyInvalid" = "Public key is invalid";
"tunnelOnDemandOptionWiFiOnly" = "Wi-Fi only";
"macNameFieldExportLog" = "Save log to:";
"alertSystemErrorOnAddTunnelTitle" = "Unable to create tunnel";
"macConfirmAndQuitAlertMessage" = "Do you want to close the tunnels manager or quit WireGuard entirely?";
"alertTunnelActivationSavedConfigFailureMessage" = "Unable to retrieve tunnel information from the saved configuration.";
"tunnelOnDemandOptionOff" = "Off";
"tunnelOnDemandSectionTitleSelectedSSIDs" = "SSIDs";
"macAlertInfoUnrecognizedInterfaceKey" = "Valid keys are: ‘PrivateKey’, ‘ListenPort’, ‘Address’, ‘DNS’ and ‘MTU’.";
"macLogColumnTitleTime" = "Time";
"alertTunnelNameEmptyMessage" = "Cannot create tunnel with an empty name";
"alertInvalidInterfaceMessageMTUInvalid" = "Interface’s MTU must be between 576 and 65535, or unspecified";
"tunnelOnDemandWiFi" = "Wi-Fi";
"alertTunnelNameEmptyTitle" = "No name provided";
"tunnelOnDemandOnlyTheseSSIDs" = "Only these SSIDs";
"tunnelOnDemandExceptTheseSSIDs" = "Except these SSIDs";
"alertUnableToWriteLogMessage" = "Unable to write logs to file";
"macMenuAddEmptyTunnel" = "Add Empty Tunnel…";
"alertInvalidInterfaceTitle" = "Invalid interface";
"macDeleteTunnelConfirmationAlertButtonTitleDelete" = "Delete";
"alertTunnelActivationFailureTitle" = "Activation failure";
"tunnelPeerTxBytes" = "Data sent";
"macLogButtonTitleClose" = "Close";
"tunnelOnDemandSSIDViewTitle" = "SSIDs";
"tunnelOnDemandOptionCellularOnly" = "Cellular only";
"tunnelEditPlaceholderTextOptional" = "Optional";
"settingsExportZipButtonTitle" = "Export zip archive";
"tunnelSectionTitleOnDemand" = "On-Demand Activation";
"alertInvalidInterfaceMessageNameRequired" = "Interface name is required";
"macViewPrivateData" = "view tunnel private keys";
"alertInvalidPeerTitle" = "Invalid peer";
"alertInvalidPeerMessageEndpointInvalid" = "Peer’s endpoint must be of the form ‘host:port’ or ‘[host]:port’";
"alertTunnelActivationErrorTunnelIsNotInactiveTitle" = "Activation in progress";
"tunnelPeerAllowedIPs" = "Allowed IPs";
"alertInvalidPeerMessagePublicKeyDuplicated" = "Two or more peers cannot have the same public key";
"deletePeerConfirmationAlertButtonTitle" = "Delete";
"alertInvalidPeerMessagePreSharedKeyInvalid" = "Peer’s preshared key must be a 32-byte key in base64 encoding";
"macAppExitingWithActiveTunnelInfo" = "The tunnel will remain active after exiting. You may disable it by reopening this application or through the Network panel in System Preferences.";
"macMenuEdit" = "Edit";
"donateLink" = "♥ Donate to the WireGuard Project";
"alertScanQRCodeCameraUnsupportedTitle" = "Camera Unsupported";
"macMenuWindow" = "Window";
"alertUnableToRemovePreviousLogTitle" = "Log export failed";
"alertTunnelActivationFailureMessage" = "The tunnel could not be activated. Please ensure that you are connected to the Internet.";
"tunnelOnDemandOptionEthernetOnly" = "Ethernet only";
"macMenuHideOtherApps" = "Hide Others";
"alertCantOpenInputZipFileMessage" = "The zip archive could not be read.";
"alertInvalidInterfaceMessagePrivateKeyInvalid" = "Interface’s private key must be a 32-byte key in base64 encoding";
"deleteTunnelButtonTitle" = "Delete tunnel";
"alertInvalidInterfaceMessageDNSInvalid" = "Interface’s DNS servers must be a list of comma-separated IP addresses";
"macAlertPrivateKeyInvalid" = "Private key is invalid.";
"deleteTunnelConfirmationAlertMessage" = "Delete this tunnel?";
"macDeleteTunnelConfirmationAlertButtonTitleCancel" = "Cancel";
"alertSystemErrorMessageTunnelConfigurationDisabled" = "The configuration is disabled.";
"alertInvalidPeerMessagePersistentKeepaliveInvalid" = "Peer’s persistent keepalive must be between 0 to 65535, or unspecified";
"alertUnableToWriteLogTitle" = "Log export failed";
"alertInvalidPeerMessagePublicKeyRequired" = "Peer’s public key is required";
"macMenuNetworksNone" = "Networks: None";
"tunnelOnDemandSSIDsKey" = "SSIDs";
"alertCantOpenOutputZipFileForWritingMessage" = "Could not open zip file for writing.";
"logViewTitle" = "Log";
"alertInvalidPeerMessagePublicKeyInvalid" = "Peer’s public key must be a 32-byte key in base64 encoding";
"tunnelOnDemandCellular" = "Cellular";
"tunnelOnDemandKey" = "On demand";
"macConfirmAndQuitAlertQuitWireGuard" = "Quit WireGuard";
"alertSystemErrorOnRemoveTunnelTitle" = "Unable to remove tunnel";
"macFieldOnDemand" = "On-Demand:";
"macMenuCloseWindow" = "Close Window";
"macSheetButtonExportLog" = "Save";
"tunnelOnDemandOptionWiFiOrCellular" = "Wi-Fi or cellular";
"alertSystemErrorOnModifyTunnelTitle" = "Unable to modify tunnel";
"alertSystemErrorMessageTunnelConfigurationReadWriteFailed" = "Reading or writing the configuration failed.";
"macMenuEditTunnel" = "Edit…";
"settingsSectionTitleTunnelLog" = "Log";
"macMenuManageTunnels" = "Manage Tunnels";
"macButtonImportTunnels" = "Import tunnel(s) from file";
"macAppExitingWithActiveTunnelMessage" = "WireGuard is exiting with an active tunnel";
"tunnelSectionTitlePeer" = "Peer";
"alertSystemErrorMessageTunnelConfigurationStale" = "The configuration is stale.";
"tunnelPeerPreSharedKey" = "Preshared key";
"alertTunnelDNSFailureMessage" = "One or more endpoint domains could not be resolved.";
"tunnelOnDemandAddMessageAddNewSSID" = "Add new";
"alertInvalidInterfaceMessageAddressInvalid" = "Interface addresses must be a list of comma-separated IP addresses, optionally in CIDR notation";
"tunnelOnDemandSectionTitleAddSSIDs" = "Add SSIDs";
"alertNoTunnelsInImportedZipArchiveTitle" = "No tunnels in zip archive";
"alertTunnelDNSFailureTitle" = "DNS resolution failure";
"tunnelOnDemandEthernet" = "Ethernet";
"macLogButtonTitleSave" = "Save…";
"deletePeerButtonTitle" = "Delete peer";
"tunnelPeerRxBytes" = "Data received";
"alertCantOpenInputZipFileTitle" = "Unable to read zip archive";
"alertScanQRCodeUnreadableQRCodeMessage" = "The scanned code could not be read";
"alertScanQRCodeUnreadableQRCodeTitle" = "Invalid Code";
"alertSystemErrorOnListingTunnelsTitle" = "Unable to list tunnels";
"tunnelPeerExcludePrivateIPs" = "Exclude private IPs";
"settingsVersionKeyWireGuardForIOS" = "WireGuard for iOS";
"tunnelInterfaceAddresses" = "Addresses";
"macAlertMultipleInterfaces" = "Configuration must have only one ‘Interface’ section.";
"scanQRCodeViewTitle" = "Scan QR code";
"macAppStoreUpdatingAlertMessage" = "App Store would like to update WireGuard";
"macUnusableTunnelMessage" = "The configuration for this tunnel cannot be found in the keychain.";
"macToolTipEditTunnel" = "Edit tunnel (⌘E)";
"tunnelEditPlaceholderTextStronglyRecommended" = "Strongly recommended";
"macMenuZoom" = "Zoom";
"alertBadArchiveTitle" = "Unable to read zip archive";
"macExportPrivateData" = "export tunnel private keys";
"alertTunnelAlreadyExistsWithThatNameTitle" = "Name already exists";
"iosViewPrivateData" = "Authenticate to view tunnel private keys.";
"tunnelPeerLastHandshakeTime" = "Latest handshake";
"macAlertPreSharedKeyInvalid" = "Preshared key is invalid";
"macEditSave" = "Save";
"macConfirmAndQuitAlertCloseWindow" = "Close Tunnels Manager";
"macMenuFile" = "File";
"macToolTipToggleStatus" = "Toggle status (⌘T)";
"macTunnelsMenuTitle" = "Tunnels";
"alertTunnelActivationSystemErrorTitle" = "Activation failure";
"alertInvalidInterfaceMessagePrivateKeyRequired" = "Interface’s private key is required";
"tunnelOnDemandAnySSID" = "Any SSID";
"alertNoTunnelsToExportTitle" = "Nothing to export";
"scanQRCodeTipText" = "Tip: Generate with `qrencode -t ansiutf8 < tunnel.conf`";
"alertNoTunnelsToExportMessage" = "There are no tunnels to export";
"macMenuImportTunnels" = "Import Tunnel(s) from File…";
"alertScanQRCodeInvalidQRCodeTitle" = "Invalid QR Code";
"macMenuViewLog" = "View Log";
"macAlertInfoUnrecognizedPeerKey" = "Valid keys are: ‘PublicKey’, ‘PresharedKey’, ‘AllowedIPs’, ‘Endpoint’ and ‘PersistentKeepalive’";
"tunnelOnDemandNoSSIDs" = "No SSIDs";
"deleteTunnelConfirmationAlertButtonTitle" = "Delete";
"tunnelEditPlaceholderTextOff" = "Off";
"macUnusableTunnelButtonTitleDeleteTunnel" = "Delete tunnel";
"tunnelEditPlaceholderTextRequired" = "Required";
"alertInvalidPeerMessageAllowedIPsInvalid" = "Peer’s allowed IPs must be a list of comma-separated IP addresses, optionally in CIDR notation";
"macMenuTunnel" = "Tunnel";
"alertTunnelAlreadyExistsWithThatNameMessage" = "A tunnel with that name already exists";
"macLogColumnTitleLogMessage" = "Log message";
"iosExportPrivateData" = "Authenticate to export tunnel private keys.";
"macSheetButtonImport" = "Import";
"alertScanQRCodeNamePromptTitle" = "Please name the scanned tunnel";
"alertUnableToRemovePreviousLogMessage" = "The pre-existing log could not be cleared";
"alertTunnelActivationBackendFailureMessage" = "Unable to turn on Go backend library.";
"settingsSectionTitleExportConfigurations" = "Export configurations";
"alertBadArchiveMessage" = "Bad or corrupt zip archive.";
"settingsVersionKeyWireGuardGoBackend" = "WireGuard Go Backend";
"macFieldOnDemandSSIDs" = "SSIDs:";
"deletePeerConfirmationAlertMessage" = "Delete this peer?";
"alertCantOpenOutputZipFileForWritingTitle" = "Unable to create zip archive";
"alertNoTunnelsInImportedZipArchiveMessage" = "No .conf tunnel files were found inside the zip archive.";
"alertTunnelActivationFileDescriptorFailureMessage" = "Unable to determine TUN device file descriptor.";
"tunnelOnDemandOptionWiFiOrEthernet" = "Wi-Fi or ethernet";
"macAlertNameIsEmpty" = "Name is required";
